<a href="https://colab.research.google.com/github/kdstheace/Python-Study/blob/main/Day0329_Pandas_GroupBy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **GroupBy의 사용**
- SQL문의 groupby와 유사

In [3]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [4]:
data = DataFrame({
    '부서' : ["영업1팀", "영업1팀", "영업2팀", "해외영업팀", "해외영업팀","영업1팀",\
            "해외영업팀", "영업1팀", "해외영업팀", "영업2팀", "영업2팀", "해외영업팀"],
    '순위' : [1, 2, 1, 3, 2, 1, 1, 1, 3, 2, 1, 2],
    '연도' : [2014, 2015, 2016, 2014, 2017, 2015, 2014, 2019, 2017, 2016, 2015, 2015],
    '매출액' : [876, 788, 900, 670, 770, 910, 760, 980, 910, 800, 877, 788]

})
data

       부서  순위    연도  매출액
0    영업1팀   1  2014  876
1    영업1팀   2  2015  788
2    영업2팀   1  2016  900
3   해외영업팀   3  2014  670
4   해외영업팀   2  2017  770
5    영업1팀   1  2015  910
6   해외영업팀   1  2014  760
7    영업1팀   1  2019  980
8   해외영업팀   3  2017  910
9    영업2팀   2  2016  800
10   영업2팀   1  2015  877
11  해외영업팀   2  2015  788

In [9]:
#부서별로 매출액의 합계를 구할 때.
data.groupby('부서')['매출액'].sum()

연도
2014    2306
2015    3363
2016    1700
2017    1680
2019     980
Name: 매출액, dtype: int64

In [ ]:
#연도별로 매출액의 합
data.groupby('연도')['매출액'].sum()

In [11]:
#각 부서별로 특정 연도의 매출액의 합계를 구하시오.
data.groupby(['부서', '연도'])['매출액'].sum()

부서     연도
영업1팀   2014     876
       2015    1698
       2019     980
영업2팀   2015     877
       2016    1700
해외영업팀  2014    1430
       2015     788
       2017    1680
Name: 매출액, dtype: int64

In [13]:
#(멀티인덱스)각 부서별로 특정 연도의 매출액의 합계를 구하시오.
grouped = data.groupby(['부서', '연도'])['매출액'].sum()
print(grouped)
grouped.index

부서     연도
영업1팀   2014     876
       2015    1698
       2019     980
영업2팀   2015     877
       2016    1700
해외영업팀  2014    1430
       2015     788
       2017    1680
Name: 매출액, dtype: int64

MultiIndex([( '영업1팀', 2014),
            ( '영업1팀', 2015),
            ( '영업1팀', 2019),
            ( '영업2팀', 2015),
            ( '영업2팀', 2016),
            ('해외영업팀', 2014),
            ('해외영업팀', 2015),
            ('해외영업팀', 2017)],
           names=['부서', '연도'])

In [15]:
grouped['해외영업팀']

연도
2014    1430
2015     788
2017    1680
Name: 매출액, dtype: int64

In [17]:
grouped[['영업1팀','영업2팀']]

부서    연도
영업1팀  2014     876
      2015    1698
      2019     980
영업2팀  2015     877
      2016    1700
Name: 매출액, dtype: int64

In [19]:
grouped['영업1팀':'해외영업팀']

부서     연도
영업1팀   2014     876
       2015    1698
       2019     980
영업2팀   2015     877
       2016    1700
해외영업팀  2014    1430
       2015     788
       2017    1680
Name: 매출액, dtype: int64

In [27]:
grouped.unstack()

연도       2014    2015    2016    2017   2019
부서
영업1팀    876.0  1698.0     NaN     NaN  980.0
영업2팀      NaN   877.0  1700.0     NaN    NaN
해외영업팀  1430.0   788.0     NaN  1680.0    NaN

In [30]:
#NaN을 전부 0으로 처리하자
updated = grouped.unstack().fillna(0)

# **Aggregation**

In [33]:
grouped2 = data.groupby('부서')
for name, group in grouped2:
  print(name)
  print(group)

영업1팀
     부서  순위    연도  매출액
0  영업1팀   1  2014  876
1  영업1팀   2  2015  788
5  영업1팀   1  2015  910
7  영업1팀   1  2019  980
영업2팀
      부서  순위    연도  매출액
2   영업2팀   1  2016  900
9   영업2팀   2  2016  800
10  영업2팀   1  2015  877
해외영업팀
       부서  순위    연도  매출액
3   해외영업팀   3  2014  670
4   해외영업팀   2  2017  770
6   해외영업팀   1  2014  760
8   해외영업팀   3  2017  910
11  해외영업팀   2  2015  788

In [35]:
grouped2.agg([np.sum, np.mean])

       순위               연도                매출액
      sum      mean    sum         mean   sum   mean
부서
영업1팀    5  1.250000   8063  2015.750000  3554  888.5
영업2팀    4  1.333333   6047  2015.666667  2577  859.0
해외영업팀  11  2.200000  10077  2015.400000  3898  779.6

In [36]:
data.groupby('부서')['매출액'].sum()

부서
영업1팀     3554
영업2팀     2577
해외영업팀    3898
Name: 매출액, dtype: int64

In [37]:
data.groupby('부서')['매출액'].agg(np.sum)

부서
영업1팀     3554
영업2팀     2577
해외영업팀    3898
Name: 매출액, dtype: int64

In [40]:
#filter와 함께 사용하기.
data.groupby('부서').filter(lambda x : len(x) > 3) #행의 갯수가 3개 이상인 데이터 출력

       부서  순위    연도  매출액
0    영업1팀   1  2014  876
1    영업1팀   2  2015  788
3   해외영업팀   3  2014  670
4   해외영업팀   2  2017  770
5    영업1팀   1  2015  910
6   해외영업팀   1  2014  760
7    영업1팀   1  2019  980
8   해외영업팀   3  2017  910
11  해외영업팀   2  2015  788

In [41]:
#각 부서별로 매출액의 평균이 850이상인 데이터만 보자.
data.groupby('부서').filter(lambda x : x['매출액'].mean() > 850)

      부서  순위    연도  매출액
0   영업1팀   1  2014  876
1   영업1팀   2  2015  788
2   영업2팀   1  2016  900
5   영업1팀   1  2015  910
7   영업1팀   1  2019  980
9   영업2팀   2  2016  800
10  영업2팀   1  2015  877

In [43]:
data.groupby('부서').filter(lambda x : x['매출액'].mean() > 880)
#data.groupby('부서')['매출액'].mean()랑 비교

     부서  순위    연도  매출액
0  영업1팀   1  2014  876
1  영업1팀   2  2015  788
5  영업1팀   1  2015  910
7  영업1팀   1  2019  980

In [50]:
#2015년도 초과하는 연도별 데이터  결과
data.groupby('연도').filter(lambda x : x['연도'].min() > 2015)

      부서  순위    연도  매출액
2   영업2팀   1  2016  900
4  해외영업팀   2  2017  770
7   영업1팀   1  2019  980
8  해외영업팀   3  2017  910
9   영업2팀   2  2016  800

# **Pivot Table**